#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python

def find_max(nums: list[int]) -> int:
    max_len = 0
    csum = 0
    first_index = {0: -1}
    for i, n in enumerate(nums):
        if n == 0:
            csum += 1
        else:
            csum -= 1
        if csum in first_index:
            cur_len = i - first_index[csum]
            if cur_len > max_len:
                max_len = cur_len
        else:
            first_index[csum] = i
    return max_len

print("->", find_max([0])) # 0
print("->", find_max([0, 1])) # 2
print("->", find_max([0,1,1,1,1,1,0,0,0])) # 6

#+end_src

#+RESULTS:
: -> 0
: -> 2
: -> 6



#+begin_reasoning
The user is presenting their implementation after our discussion. They've written a Python function =find_max= that seems correct. The results show 0, 2, 6 which match expected outputs. They likely want feedback on their solution. According to the context, we should not provide large blocks of code but they wrote it themselves. Since they're showing the completed code, we can review it, but per the method, we should acknowledge the work and maybe suggest a small refinement or ask if they want to test more cases. Also note that they used 0 as +1 and 1 as -1, which works fine. The code looks correct. They might wonder if it's optimal or if there are edge cases. We can provide concise feedback, note it looks correct, and ask if they'd like to reflect or test further.

Thus, response: affirm correctness, mention edge cases (empty array? but they have none). Optionally note that they could treat 0 as -1 and 1 as +1 as other common variant. But overall it's good.

I should keep the response concise and supportive, in line with the Solve It Method: human in control, they've done the work, I just assist.
#+end_reasoning

Your implementation looks correct and passes the given examples.

A few observations:

- Your choice of treating 0 as =+1= and 1 as =-1= is fine — the
  opposite also works as long as you're consistent.
- The initial hashmap entry ={0: -1}= correctly handles balanced
  subarrays starting at index 0.
- The code is clear and minimal, which aligns with Polya’s "act and
  review" phase.

Would you like to test any additional edge cases (e.g., all zeros,
empty array, large alternating pattern) or discuss possible
optimizations/alternatives?

** Alternative solution

Sure. Here's a replacement of the hashmap with a fixed‑size array,
assuming you know the length =n= in advance.

*Idea* The cumulative sum ranges from =-n= to =n=.  Map a sum =s= to
index =s + n=.  Use a sentinel (e.g., =-2=) to mark that a sum hasn't
been seen yet.

*Example implementation (Python, no imports)*

#+begin_src python
def find_max_array(nums: list[int]) -> int:
    n = len(nums)
    # array of size 2*n+1, filled with sentinel -2
    first = [-2] * (2 * n + 1)
    offset = n                # to shift sum into non‑negative index
    first[offset] = -1        # sum 0 at index -1
    max_len = 0
    csum = 0
    for i, x in enumerate(nums):
        csum += 1 if x == 0 else -1   # same as before
        idx = csum + offset
        if first[idx] != -2:
            # sum seen before
            cur = i - first[idx]
            if cur > max_len:
                max_len = cur
        else:
            first[idx] = i   # store first occurrence
    return max_len

print("->", find_max_array([0])) # 0
print("->", find_max_array([0, 1])) # 2
print("->", find_max_array([0,1,1,1,1,1,0,0,0])) # 6

#+end_src

#+RESULTS:
: -> 0
: -> 2
: -> 6

It behaves identically to the hashmap version but uses plain list
lookup, which can be slightly faster in practice.  The space
complexity remains O(n).

